/******************Cloudoptek Raman project*********************
(c) 2018 Cloudoptek Co. Ltd.
 All rights reserved.
 Author: winkey su
 Date:2019.05.19
 Function:简单实现flash log功能时，需要移植实现的flash有关代码
***************************************************************/
#include "basic_f.h"
#include "glb_cfg.h"
#include "macro_func.h"
#include "w25q64_app.h"


//***************************macro******************************


//***************************typedef****************************


//****************************var*******************************
//每次写入flash对应的起始地址
static u32 s_flash_wr_pos = 0;

//*************************macro func***************************


//***************************mix********************************


//***************************func*******************************
/*************************************************************************************
  * @brief flash log移植有关的独有起始工作
  * @param None.
  * @retval 0 - 成功； 非0 - 失败
**************************************************************************************/
s16 elog_pf_port_init(void)
{
    s16 result = 0;

    W25Q64_AppInit();

    s_flash_wr_pos = 0;

    return 0;
}

/*************************************************************************************
  * @brief flash log移植有关的独有起始工作
  * @param log - 待存入flash的log
           size - 待存入的log字节长度
  * @retval None
**************************************************************************************/
void elog_pf_port_output(const char *log, size_t size)
{
    u16 page_sz = 256;
    
    for(u32 i = 0; i < size; i += page_sz)
    {
        if(0 == W25Q64_WritePage(&g_w25q64_handle, s_flash_wr_pos, (u8*)log, 256))
        {
            s_flash_wr_pos += page_sz;
        }
    }
}

/*************************************************************************************
  * @brief PF LOG 上锁
  * @param  None
  * @retval None
**************************************************************************************/
void elog_pf_port_lock(void)
{

}

/*************************************************************************************
  * @brief PF LOG 解锁
  * @param  None
  * @retval None
**************************************************************************************/
void elog_pf_port_unlock(void)
{

}

/*************************************************************************************
  * @brief PF LOG 清空
  * @param  None
  * @retval None
**************************************************************************************/
u32 elog_pf_port_clear(void)
{
    u32 errSz = 1024*1024;

    for(u32 ddr = 0; ddr < errSz; ddr += 64*1024)
    {
        W25Q64_EraseBlock64K(&g_w25q64_handle, ddr);
    }

    s_flash_wr_pos = 0;
    
    return errSz;
}

/*************************************************************************************
  * @brief PF LOG 读取相应log
  * @param pBuff - 存放读出来的log的地址
            sz - 要读取的log的字节长度
  * @retval None
**************************************************************************************/
s16 elog_pf_read(u8* const pBuff, u32 start, u32 sz)
{
    s16 ret = W25Q64_ReadData(&g_w25q64_handle, start, (u8*)pBuff, sz);
    return ret;
}

